<?php
/*
    -1:只允许 POST 方法
    -2:API 使用超出限制
    -3:无权是使用此接口
    -4:登录失败次数过多,账号暂时被封禁
    -5:access_token 不可用
    -6:access_token 和 app_key 不一致
    -99:此功能暂停开放,请稍候
    1:操作成功
    2:只允许 POST 方法
    3:未知错误
    4:操作失败
    5:参数错误

 */
return array(
    'STATUS_ID' => array(
        '-1'  =>    '只允许 POST 方法',
        '-2'  =>    'app_id不能为空',
        '-3'  =>    'API 使用超出限制',
        '-4'  =>    '参数错误',
        '-5'  =>    'api帐号验证不通过',
        '-6'  =>    'api帐号已被暂停',
        '-7'  =>    '登录失败次数过多，账号被暂时封禁',
        '-8'  =>    '数据库连接失败',
        '-9'  =>    'user_id不存在',
        '-10' =>    '非法操作',
        '-11' =>    '请检查必填参数',
        '-12' =>    '超过批量操作个数限制(%s)',
        '-13' =>    'status错误',
        '-14' =>    '%s只能是0和1',
        '-15' =>    '缺失参数',
        '-16' =>    'APP没有权限',
        '-17' =>    '参数类型错误',
        '-18' =>    '已经登出',
        '0'   =>    '操作失败',
        '1'   =>    '操作成功',
        '2'   =>    '删除专属定制成功',
        '-19' =>    '删除专属定制参数非法',
        '-20' =>    '删除专属定制失败',
        '-21' =>    '删除专属定制失败!',



    ),
);
?>